src/InformationRegisters/КИИ_МониторингОшибокЖурнал/КИИ_МониторингОшибокЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_МониторингОшибокЖурнал</name>
  <resources>
    <name>ПерваяДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнееВхождение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОтправок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Критичность</name>
    <type>
      <types>EnumRef.КИИ_УровниКритичности</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетАнализа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроанализированаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаАнализаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправленаВТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Игнорировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОтИИ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХешОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/КИИ_УровниКритичности/КИИ_УровниКритичности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КИИ_УровниКритичности</name>
  <enumValues>
    <name>Низкая</name>
  </enumValues>
  <enumValues>
    <name>Средняя</name>
  </enumValues>
  <enumValues>
    <name>Высокая</name>
  </enumValues>
  <enumValues>
    <name>Критическая</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/КИИ_АудиторКода/Module.bsl
// Аудитор кода - тонкий клиент к внешнему rlm-шиму (D3).
// Механика анализа кода вынесена во внешний сервис (rlm-tools-bsl через REST-шим):
// 1С отправляет координату из стека ошибки и получает метод с телом и графом вызовов.
// Ум (диагноз) ставит LLM через КИИ_КоннекторИИ (gateway ИИконы), отчет сохраняется внутри 1С.

#Область ПрограммныйИнтерфейс

// Анализирует место ошибки по координате из стека (имя модуля и номер строки).
// Отправляет запрос внешнему rlm-шиму и возвращает найденный метод с телом и вызовами.
//
// Параметры:
//  ИмяМодуля - Строка - имя модуля из стека, например "КИИ_HTTPКлиент"
//  НомерСтроки - Число - номер строки из стека
//  АдресШима - Строка - базовый URL rlm-шима; пусто - берется адрес по умолчанию
//
// Возвращаемое значение:
//  Соответствие - десериализованный ответ шима:
//   * ok - Булево - признак успеха
//   * module - Строка - имя модуля
//   * method - Соответствие - name, line_range, is_export, loc, body, callers, callers_count
//   При недоступности шима возвращается ok = Ложь и error - Строка
//
Функция ПроанализироватьМестоОшибки(ИмяМодуля, НомерСтроки, АдресШима = "") Экспорт

	Если Не ЗначениеЗаполнено(АдресШима) Тогда
		АдресШима = АдресШимаПоУмолчанию();
	КонецЕсли;

	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("module", ИмяМодуля);
	ТелоЗапроса.Вставить("line", НомерСтроки);

	// Прокси = Неопределено: шим локальный (127.0.0.1), идем напрямую, минуя прокси ИИконы.
	Результат = КИИ_HTTPКлиент.ВыполнитьЗапрос("POST", АдресШима + "/audit", ТелоЗапроса, , 30, Неопределено);

	Если Не Результат.Успешно Тогда
		Ответ = Новый Соответствие;
		Ответ.Вставить("ok", Ложь);
		Ответ.Вставить("error", "Шим недоступен, код состояния: " + Результат.КодСостояния);
		Возврат Ответ;
	КонецЕсли;

	Возврат КИИ_HTTPКлиент.JsonВСтруктуру(Результат.Тело);

КонецФункции

// Ставит диагноз по ошибке: получает код места ошибки от rlm-шима и отправляет
// его вместе с текстом ошибки в модель ИИ через коннектор. Инструменты не нужны -
// контекст кода уже получен от rlm.
//
// Параметры:
//  ТекстОшибки - Строка - текст ошибки (из стека или журнала регистрации)
//  ИмяМодуля - Строка - имя модуля из стека
//  НомерСтроки - Число - номер строки из стека
//  Модель - СправочникСсылка.КИИ_МоделиИИ - модель ИИ; Неопределено - берется из настроек мониторинга
//
// Возвращаемое значение:
//  Структура:
//   * ЭтоОшибка - Булево - не удалось получить диагноз
//   * Диагноз - Строка - текст диагноза от модели
//   * ТекстОшибки - Строка - причина, если ЭтоОшибка = Истина
//
Функция ДиагностироватьОшибку(ТекстОшибки, ИмяМодуля, НомерСтроки, Знач Модель = Неопределено) Экспорт

	Итог = Новый Структура("ЭтоОшибка, Диагноз, ТекстОшибки", Истина, "", "");

	Если Модель = Неопределено Тогда
		Настройки = КИИ_МониторингОшибок.ПолучитьНастройкиМониторинга();
		Модель = Настройки.МодельДляАнализа;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Модель) Тогда
		Итог.ТекстОшибки = НСтр("ru = 'Модель для анализа не настроена'");
		Возврат Итог;
	КонецЕсли;

	Контекст = ПроанализироватьМестоОшибки(ИмяМодуля, НомерСтроки);

	Промпт = Новый Структура;
	Промпт.Вставить("СистемныйПромпт", СистемныйПромптДиагноза());
	КонтекстДляПромпта = ФорматироватьКонтекстДляПромпта(Контекст, ИмяМодуля, НомерСтроки);
	ТекстПромпта = СтрШаблон(
		НСтр("ru = 'Текст ошибки:
			|%1
			|
			|%2'"),
		ТекстОшибки, КонтекстДляПромпта);
	Промпт.Вставить("ПользовательскийПромпт", ТекстПромпта);

	// Ум только через коннектор ИИконы (gateway), не мимо него.
	Ответ = КИИ_КоннекторИИ.ЗапросКМодели(Модель, Промпт);
	Если Ответ.ЭтоОшибка Тогда
		Итог.ТекстОшибки = Ответ.ТекстОшибки;
		Возврат Итог;
	КонецЕсли;

	Итог.ЭтоОшибка = Ложь;
	Итог.Диагноз = Ответ.ТекстОтвета;
	Возврат Итог;

КонецФункции

// Диагностирует ошибку из журнала мониторинга по её хешу и сохраняет диагноз обратно
// в журнал (поле ОписаниеОтИИ). Замыкает цикл: ошибка внутри 1С -> код от rlm -> диагноз -> внутрь 1С.
//
// Параметры:
//  ХешОшибки - Строка - хеш записи регистра КИИ_МониторингОшибокЖурнал
//  Модель - СправочникСсылка.КИИ_МоделиИИ - модель ИИ; Неопределено - из настроек мониторинга
//
// Возвращаемое значение:
//  Структура:
//   * ЭтоОшибка - Булево - диагноз не получен
//   * Диагноз - Строка - текст диагноза
//   * ТекстОшибки - Строка - причина отказа
//   * Сохранено - Булево - диагноз записан в журнал
//
Функция ДиагностироватьИСохранить(ХешОшибки, Знач Модель = Неопределено) Экспорт

	Итог = Новый Структура;
	Итог.Вставить("ЭтоОшибка",   Истина);
	Итог.Вставить("Диагноз",     "");
	Итог.Вставить("ТекстОшибки", "");
	Итог.Вставить("Сохранено",   Ложь);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Журнал.ТекстОшибки КАК ТекстОшибки
		|ИЗ
		|	РегистрСведений.КИИ_МониторингОшибокЖурнал КАК Журнал
		|ГДЕ
		|	Журнал.ХешОшибки = &ХешОшибки";
	Запрос.УстановитьПараметр("ХешОшибки", ХешОшибки);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Итог.ТекстОшибки = НСтр("ru = 'Запись журнала по хешу не найдена'");
		Возврат Итог;
	КонецЕсли;

	Координата = ИзвлечьКоординатуИзСтека(Выборка.ТекстОшибки);
	Если Координата = Неопределено Тогда
		Итог.ТекстОшибки = НСтр("ru = 'В тексте ошибки нет координаты модуль:строка - аудитор кода неприменим'");
		Возврат Итог;
	КонецЕсли;

	Результат = ДиагностироватьОшибку(Выборка.ТекстОшибки, Координата.Модуль, Координата.Строка, Модель);
	Итог.ЭтоОшибка = Результат.ЭтоОшибка;
	Итог.Диагноз = Результат.Диагноз;
	Итог.ТекстОшибки = Результат.ТекстОшибки;

	Если Не Результат.ЭтоОшибка Тогда
		СохранитьДиагнозВЖурнал(ХешОшибки, Результат.Диагноз);
		Итог.Сохранено = Истина;
	КонецЕсли;

	Возврат Итог;

КонецФункции

// Автономный анализ новых ошибок с координатой в стеке (для регламентного задания).
// Берет новые ошибки журнала, для тех, где стек содержит координату модуль:строка,
// ставит диагноз через аудитор кода, сохраняет в журнал и отправляет в Telegram.
// Ошибки без координаты не трогает - их разбирает обычный пакетный анализ.
//
// Параметры:
//  МаксимумОшибок - Число - предел ошибок на один запуск
//  Модель - СправочникСсылка.КИИ_МоделиИИ - модель ИИ; Неопределено - из настроек мониторинга
//
// Возвращаемое значение:
//  Число - количество проанализированных ошибок
//
Функция АвтоанализНовыхОшибок(МаксимумОшибок = 10, Знач Модель = Неопределено) Экспорт

	Настройки = КИИ_МониторингОшибок.ПолучитьНастройкиМониторинга();
	Если Модель = Неопределено Тогда
		Модель = Настройки.МодельДляАнализа;
	КонецЕсли;

	// ПЕРВЫЕ требует числовой литерал (параметр недопустим) - подставляем число в текст.
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ " + Формат(МаксимумОшибок, "ЧГ=0") + "
		|	Журнал.ХешОшибки            КАК ХешОшибки,
		|	Журнал.ТекстОшибки          КАК ТекстОшибки,
		|	Журнал.Событие              КАК Событие,
		|	Журнал.Пользователь         КАК Пользователь,
		|	Журнал.Компьютер            КАК Компьютер,
		|	Журнал.ПерваяДатаВремя       КАК ПерваяДатаВремя,
		|	Журнал.КоличествоПовторений  КАК КоличествоПовторений
		|ИЗ
		|	РегистрСведений.КИИ_МониторингОшибокЖурнал КАК Журнал
		|ГДЕ
		|	Журнал.ТребуетАнализа = ИСТИНА
		|	И Журнал.Игнорировать = ЛОЖЬ
		|УПОРЯДОЧИТЬ ПО
		|	Журнал.ПерваяДатаВремя";
	Выборка = Запрос.Выполнить().Выбрать();

	МассивРезультатов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Координата = ИзвлечьКоординатуИзСтека(Выборка.ТекстОшибки);
		Если Координата = Неопределено Тогда
			Продолжить; // нет координаты - оставляем обычному пакетному анализу
		КонецЕсли;

		Результат = ДиагностироватьОшибку(Выборка.ТекстОшибки, Координата.Модуль, Координата.Строка, Модель);
		Если Результат.ЭтоОшибка Тогда
			Продолжить;
		КонецЕсли;

		СохранитьДиагнозВЖурнал(Выборка.ХешОшибки, Результат.Диагноз);

		ДанныеОшибки = Новый Структура(
			"ХешОшибки, ТекстОшибки, Событие, Пользователь, Компьютер, ПерваяДатаВремя, КоличествоПовторений");
		ЗаполнитьЗначенияСвойств(ДанныеОшибки, Выборка);
		РезультатАнализа = Новый Структура("ДанныеОшибки, Критичность, Описание",
			ДанныеОшибки, Перечисления.КИИ_УровниКритичности.Средняя, Результат.Диагноз);
		МассивРезультатов.Добавить(РезультатАнализа);
	КонецЦикла;

	Если МассивРезультатов.Количество() > 0 Тогда
		КИИ_МониторингОшибокTelegram.ОтправитьРезультатыВТелеграм(Настройки, МассивРезультатов);
	КонецЕсли;

	Возврат МассивРезультатов.Количество();

КонецФункции

// Точка входа регламентного задания КИИ_АудиторКодаАвтоанализ.
// Регламент вызывает процедуру без параметров; логика - в АвтоанализНовыхОшибок.
//
Процедура ВыполнитьАвтоанализ() Экспорт

	АвтоанализНовыхОшибок();

КонецПроцедуры

// Проверяет доступность rlm-шима через эндпоинт health.
//
// Параметры:
//  АдресШима - Строка - базовый URL rlm-шима; пусто - берется адрес по умолчанию
//
// Возвращаемое значение:
//  Булево - Истина, если шим ответил успешно
//
Функция ШимДоступен(АдресШима = "") Экспорт

	Если Не ЗначениеЗаполнено(АдресШима) Тогда
		АдресШима = АдресШимаПоУмолчанию();
	КонецЕсли;

	Результат = КИИ_HTTPКлиент.ВыполнитьЗапрос("GET", АдресШима + "/health", , , 10, Неопределено);
	Возврат Результат.Успешно;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Адрес rlm-шима по умолчанию.
// MVP: локальный порт 9001. В дальнейшем вынести в константу настройки аудитора.
//
// Возвращаемое значение:
//  Строка - базовый URL шима без завершающего слеша
//
Функция АдресШимаПоУмолчанию()

	Хост = Константы.КИИ_АдресХостаШимаАудитора.Получить();
	Если Не ЗначениеЗаполнено(Хост) Тогда
		Хост = ХостШимаПоТипуБазы();
	КонецЕсли;
	Порт = Константы.КИИ_ПортШимаАудитора.Получить();
	Если Не ЗначениеЗаполнено(Порт) Или Порт = 0 Тогда
		Порт = 9001;
	КонецЕсли;
	Возврат "http://" + Хост + ":" + Формат(Порт, "ЧГ=0");

КонецФункции

// Хост шима по типу базы: файловая - локально (127.0.0.1);
// серверная - хост сервера кластера 1С (где rphost, там же логично держать шим).
//
// Возвращаемое значение:
//  Строка - хост шима
//
// Осмысленный дефолт, а не конфигурационная ошибка: шим аудитора живет рядом с базой,
// 127.0.0.1 - фолбэк, переопределяется константой КИИ_АдресХостаШимаАудитора.
// BSLLS:UsingHardcodeNetworkAddress-off
Функция ХостШимаПоТипуБазы()

	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Возврат "127.0.0.1";
	КонецЕсли;

	ХостСервера = ИзвлечьХостСервераБазы();
	Возврат ?(ЗначениеЗаполнено(ХостСервера), ХостСервера, "127.0.0.1");
	// BSLLS:UsingHardcodeNetworkAddress-on

КонецФункции

// Извлекает хост сервера 1С из строки соединения серверной базы (Srvr="хост:порт").
// Берет первый сервер списка, отбрасывает порт кластера.
//
// Возвращаемое значение:
//  Строка - хост сервера 1С; пусто, если не серверная или не распознано
//
Функция ИзвлечьХостСервераБазы()

	Параметры = СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы());
	Если Не Параметры.Свойство("Srvr") Тогда
		Возврат "";
	КонецЕсли;

	ПерваяЧасть = СтрРазделить(СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(Параметры.Srvr), ",")[0];
	ХостИПорт = СтрРазделить(ПерваяЧасть, ":");
	Возврат СокрЛП(ХостИПорт[0]);

КонецФункции

// Извлекает координату места ошибки (имя модуля и номер строки) из первого кадра
// стека вида "{[Расширение ]ОбщийМодуль.ИмяМодуля.Модуль(НомерСтроки)}".
//
// Параметры:
//  ТекстСтека - Строка - текст ошибки со стеком вызовов
//
// Возвращаемое значение:
//  Структура (Модуль - Строка, Строка - Число), Неопределено - если координата не найдена
//
Функция ИзвлечьКоординатуИзСтека(ТекстСтека)

	Маркер = "ОбщийМодуль.";
	Поз = СтрНайти(ТекстСтека, Маркер);
	Если Поз = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Хвост = Сред(ТекстСтека, Поз + СтрДлина(Маркер));
	ПозРазделитель = СтрНайти(Хвост, ".Модуль(");
	Если ПозРазделитель = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ИмяМодуля = Лев(Хвост, ПозРазделитель - 1);
	Остаток = Сред(Хвост, ПозРазделитель + СтрДлина(".Модуль("));
	ПозСкобка = СтрНайти(Остаток, ")");
	Если ПозСкобка = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	НомерСтроки = КИИ_HTTPКлиент.ПолучитьЧислоБезопасно(Лев(Остаток, ПозСкобка - 1), 0);
	Если НомерСтроки = 0 Или Не ЗначениеЗаполнено(ИмяМодуля) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура("Модуль, Строка", ИмяМодуля, НомерСтроки);

КонецФункции

// Сохраняет диагноз аудитора в запись журнала мониторинга и снимает флаг ТребуетАнализа,
// чтобы обычный пакетный анализ не разбирал эту ошибку повторно.
//
// Параметры:
//  ХешОшибки - Строка - хеш записи регистра КИИ_МониторингОшибокЖурнал
//  Диагноз - Строка - текст диагноза от аудитора
//
Процедура СохранитьДиагнозВЖурнал(ХешОшибки, Диагноз)

	ПоляОбновления = Новый Структура;
	ПоляОбновления.Вставить("ТребуетАнализа",     Ложь);
	ПоляОбновления.Вставить("ПроанализированаИИ", Истина);
	ПоляОбновления.Вставить("ОшибкаАнализаИИ",    Ложь);
	ПоляОбновления.Вставить("ОписаниеОтИИ",       Диагноз);
	КИИ_МониторингОшибокРегистры.ОбновитьЗаписьРегистраОшибки(ХешОшибки, ПоляОбновления);

КонецПроцедуры

// Оформляет контекст кода от шима в текст для промпта модели.
//
// Параметры:
//  Контекст - Соответствие - ответ ПроанализироватьМестоОшибки
//  ИмяМодуля - Строка - имя модуля (для сообщения при отсутствии кода)
//  НомерСтроки - Число - номер строки
//
// Возвращаемое значение:
//  Строка - текст с кодом метода и списком вызывающих
//
Функция ФорматироватьКонтекстДляПромпта(Контекст, ИмяМодуля, НомерСтроки)

	Если Контекст = Неопределено Или Не КИИ_HTTPКлиент.ПолучитьБулевоБезопасно(Контекст.Получить("ok")) Тогда
		Возврат СтрШаблон(НСтр("ru = 'Код места ошибки недоступен (модуль %1, строка %2).'"), ИмяМодуля, НомерСтроки);
	КонецЕсли;

	Метод = Контекст.Получить("method");
	Если Метод = Неопределено Тогда
		Возврат СтрШаблон(НСтр("ru = 'Метод по координате не найден (модуль %1, строка %2).'"), ИмяМодуля, НомерСтроки);
	КонецЕсли;

	ИмяМетода = КИИ_HTTPКлиент.ПолучитьСтрокуБезопасно(Метод.Получить("name"));
	Тело = КИИ_HTTPКлиент.ПолучитьСтрокуБезопасно(Метод.Получить("body"));

	ТекстВызовов = "";
	Вызовы = Метод.Получить("callers");
	Если ТипЗнч(Вызовы) = Тип("Массив") Тогда
		Для Каждого Вызов Из Вызовы Цикл
			Файл = КИИ_HTTPКлиент.ПолучитьСтрокуБезопасно(Вызов.Получить("file"));
			НомерВызова = КИИ_HTTPКлиент.ПолучитьЧислоБезопасно(Вызов.Получить("line"));
			ТекстВызовов = ТекстВызовов + СтрШаблон(НСтр("ru = '- %1:%2'"), Файл, НомерВызова) + Символы.ПС;
		КонецЦикла;
	КонецЕсли;

	ОписаниеВызовов = ?(ПустаяСтрока(ТекстВызовов), НСтр("ru = '(нет данных)'"), ТекстВызовов);
	Возврат СтрШаблон(
		НСтр("ru = 'Код места ошибки (%1):
			|%2
			|
			|Вызывается из:
			|%3'"),
		ИмяМетода, Тело, ОписаниеВызовов);

КонецФункции

// Системный промпт для диагноза ошибки.
//
// Возвращаемое значение:
//  Строка - системная инструкция модели
//
Функция СистемныйПромптДиагноза()

	Возврат НСтр("ru = 'Ты эксперт по 1С:Предприятие. По тексту ошибки и коду места ошибки
		|определи вероятную причину и предложи конкретное исправление.
		|Отвечай кратко и по делу, на русском языке.'");

КонецФункции

#КонецОбласти
